&НаСервере
Функция PauseComp(пауза, ВремяНачала = Неопределено) Экспорт
		Если ВремяНачала = Неопределено Тогда
			ВремяНачала = ТекущаяДата();
		Иначе 				
			Возврат 0; 
		КонецЕсли;		
		
		Индекс = 0; 
	    Пока  ВремяНачала + пауза >= ТекущаяДата() Цикл
			Индекс = Индекс + 1; 
			ОстатокПаузы = ТекущаяДата() - ВремяНачала + пауза;  
			Если Индекс > 30 Тогда   
				Индекс = 0;
				PauseComp(пауза, ВремяНачала);                                    
		    КонецЕсли
	    КонецЦикла;
        Возврат 0;	    
	КонецФункции 
	
&НаСервере
Функция PauseCompК(пауза, ВремяНачала = Неопределено) Экспорт    
	PauseComp(пауза, ВремяНачала)
КонецФункции
